# Running the program computes the hash and prints it in
# a human-readable hex format.
$ go run sha256-hashes.go
sha256 цей рядок
7c26dbccec9baa0fe6e62e8a34509b567babad17382fd...


# Ви можете обчислювати і інші типи хешів використовуючи
# схожий до вищенаведеного сценарій. Напряклад, для
# прорахунку SHA512 імпортуйте `crypto/sha512` і
# скористайтесь `sha512.New()`.

# Зауважте - якщо вам потрібні криптографічно-безпечні
# хеші - спершу порівняйте переваги і недоліки
# [різноматнітних алгоритмів хешування](https://uk.wikipedia.org/wiki/Криптографічна_хеш-функція)!
