# Простий вивід; дата і час
# будуь залежати від того коли приклад запускався.
$ go run logging.go
2023/12/17 18:22:25 standard logger
2023/12/17 18:22:25.121928 with micro
2023/12/17 18:22:25 logging.go:33: with file/line
my:2023/12/17 18:22:25 from mylog
ohmy:2023/12/17 18:22:25 from mylog
from buflog:buf:2023/12/17 18:22:25 hello

# Ми додали перенос для зручності, в реальності
# воно будуть виведені однією лінією.
{"time":"2023-12-17T18:22:25.121979+02:00",
"level":"INFO","msg":"hi there"}
{"time":"2023-12-17T18:22:25.121996+02:00",
"level":"INFO","msg":"hello again","key":"val",
"age":25}
