// У Go існує підтримка _повернення кількох значень_ з функцій.
// Ця особливість часто ідіоматично використовується в Go,
// для повернення функцією результату роботи та помилки .

package main

import "fmt"

// Конструкція `(int, int)` - цією декларацією функція
// показує, що вона зобов'язується повернути два цілих числа.
func vals() (int, int) {
	return 3, 7
}

func main() {

	// В цьому прикладі - ми декларуємо дві різні змінні шляхом
	// присвоєння результату функції (що повертає два значення).
	a, b := vals()
	fmt.Println(a)
	fmt.Println(b)

	// Якщо ви плануєте використати лише частину повернених
	// значень, скористайтесь пустим ідентифікатором (`_`).
	_, c := vals()
	fmt.Println(c)
}
