# Хоч зрізи і іншого типу ніж масиви, відображатимуться
# вони однаково, під час друку за допомогою `fmt.Println`.
$ go run slices.go
uninit: [] true true
emp: [  ] len: 3 cap: 3
set: [a b c]
get: c
len: 3
apd: [a b c d e f]
cpy: [a b c d e f]
sl1: [c d e]
sl2: [a b c d e]
sl3: [c d e f]
dcl: [g h i]
t == t2
2d:  [[0] [1 2] [2 3 4]]

# Рекомендуємо прочитати [чудовий пост](http://blog.golang.org/2011/01/go-slices-usage-and-internals.html)
# (за авторства команди розробників Go), щоб
# отримати докладну інформацію про розробку та
# застосування зрізів в `Go`.

# Після того як ми бачили масиви та зрізи,
# звернемо увагу на іншу важливу структуру
# даних в Go &mdash; _мапи_.
